alibaba/AliOS-Things/platform/mcu/lpc54102/LPC54102_cm4_features.h
/* @brief Number of connected outputs */
#define FSL_FEATURE_PINT_NUMBER_OF_CONNECTED_OUTPUTS (8)

/* RTC module features */

/* @brief Has CTRL:RTC_OSC_PD Bit */
#define FSL_FEATURE_RTC_HAS_NO_OSC_PD (1)

/* SCT module features */

/* @brief Number of events */
#define FSL_FEATURE_SCT_NUMBER_OF_EVENTS (13)
/* @brief Number of states */
#define FSL_FEATURE_SCT_NUMBER_OF_STATES (13)
/* @brief Number of match capture */
#define FSL_FEATURE_SCT_NUMBER_OF_MATCH_CAPTURE (13)

/* SYSCON module features */

#if defined(CPU_LPC54102J256BD64_cm4) || defined(CPU_LPC54102J256UK49_cm4)
    /* @brief Pointer to ROM IAP entry functions */
    #define FSL_FEATURE_SYSCON_IAP_ENTRY_LOCATION (0x03000205)
    /* @brief Flash page size in bytes */
    #define FSL_FEATURE_SYSCON_FLASH_PAGE_SIZE_BYTES (256)
    /* @brief Flash sector size in bytes */
    #define FSL_FEATURE_SYSCON_FLASH_SECTOR_SIZE_BYTES (32768)
    /* @brief Flash size in bytes */
    #define FSL_FEATURE_SYSCON_FLASH_SIZE_BYTES (262144)
#elif defined(CPU_LPC54102J512BD64_cm4) || defined(CPU_LPC54102J512UK49_cm4)
    /* @brief Pointer to ROM IAP entry functions */
    #define FSL_FEATURE_SYSCON_IAP_ENTRY_LOCATION (0x03000205)
    /* @brief Flash page size in bytes */
    #define FSL_FEATURE_SYSCON_FLASH_PAGE_SIZE_BYTES (256)
    /* @brief Flash sector size in bytes */
    #define FSL_FEATURE_SYSCON_FLASH_SECTOR_SIZE_BYTES (32768)
    /* @brief Flash size in bytes */
    #define FSL_FEATURE_SYSCON_FLASH_SIZE_BYTES (524288)
#endif /* defined(CPU_LPC54102J256BD64) || defined(CPU_LPC54102J256UK49) */

#endif /* _LPC54102_cm4_FEATURES_H_ */

